Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/katafc/go-httpd/target_count_3/repeat_6/1.txt
2020/01/17 06:25:09 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8001/
2020/01/17 06:25:40 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Completed 200000 requests
Finished 263952 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8001
Document Path:          /
Document Length:        26 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      263952
Failed requests:        0
Total transferred:      37745422 bytes
HTML transferred:       6862804 bytes
Requests per second:    8798.40 [#/sec] (mean)
Time per request:       11.366 [ms] (mean)
Time per request:       0.114 [ms] (mean, across all concurrent requests)
Transfer rate:          1228.69 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   9.4      0    1020
Processing:     0   11   2.3     11     252
Waiting:        0   11   2.2     11     252
Total:          0   11   9.7     11    1030
Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     12
  90%     12
  95%     12
  98%     13
  99%     16
 100%   1030 (longest request)
2020/01/17 06:25:40 Matched stat line [Connect:        0    0   9.4      0    1020 Connect 0 0 9.4 0 1020]
{"connect":{"max":1020,"mean":0,"median":0,"min":0,"stdDev":9.399999618530273},"percentiles":{"100":1030,"50":11,"66":12,"75":12,"80":12,"90":12,"95":12,"98":13,"99":16},"processing":{"max":252,"mean":11,"median":11,"min":0,"stdDev":2.299999952316284},"total":{"max":1030,"mean":11,"median":11,"min":0,"stdDev":9.699999809265137},"waiting":{"max":252,"mean":11,"median":11,"min":0,"stdDev":2.200000047683716}}
2020/01/17 06:25:40 Matched stat line [Processing:     0   11   2.3     11     252 Processing 0 11 2.3 11 252]
2020/01/17 06:25:40 Matched stat line [Waiting:        0   11   2.2     11     252 Waiting 0 11 2.2 11 252]
2020/01/17 06:25:40 Matched stat line [Total:          0   11   9.7     11    1030 Total 0 11 9.7 11 1030]
2020/01/17 06:25:40 Matched percentline [  50%     11 50 11]
2020/01/17 06:25:40 Matched percentline [  66%     12 66 12]
2020/01/17 06:25:40 Matched percentline [  75%     12 75 12]
2020/01/17 06:25:40 Matched percentline [  80%     12 80 12]
2020/01/17 06:25:40 Matched percentline [  90%     12 90 12]
2020/01/17 06:25:40 Matched percentline [  95%     12 95 12]
2020/01/17 06:25:40 Matched percentline [  98%     13 98 13]
2020/01/17 06:25:40 Matched percentline [  99%     16 99 16]
2020/01/17 06:25:40 Matched percentline [ 100%   1030 100 1030]